In [1]:
import numpy as np

import pandas as pd

In [2]:
data = {'apple':[3,2,0,1,8,],'ornages':[0,5,6,7,4]}

In [3]:
purchases = pd.DataFrame(data)
purchases

   apple  ornages
0      3        0
1      2        5
2      0        6
3      1        7
4      8        4

In [5]:
purchases = pd.DataFrame(data,index=['sneha','papi','priya','jayshree','raj'])

purchases

          apple  ornages
sneha         3        0
papi          2        5
priya         0        6
jayshree      1        7
raj           8        4

In [ ]:
#Req: I want to get the output of what jayshree has purchases --bascially i want locate jayshree purchased

In [6]:
purchases.loc['jayshree']

apple      1
ornages    7
Name: jayshree, dtype: int64

In [8]:
purchases.loc['papi']

apple      2
ornages    5
Name: papi, dtype: int64

In [ ]:
iloc method---Indexing number

In [10]:
purchases.iloc[4]

apple      8
ornages    4
Name: raj, dtype: int64

In [11]:
purchases.iloc[2]

apple      0
ornages    6
Name: priya, dtype: int64

In [ ]:
#Reading the data from csvs

cvs--comma separted value

In [13]:
data = {'apple':[3,2,0,1],'oranges':[0,3,7,2]}

In [15]:
purchases = pd.DataFrame(data)
purchases

   apple  oranges
0      3        0
1      2        3
2      0        7
3      1        2

In [18]:
purchases = pd.DataFrame(data,index=['sneha','papi','priya','jayshree'])

purchases

          apple  oranges
sneha         3        0
papi          2        3
priya         0        7
jayshree      1        2

In [ ]:
purchases.csv

In [21]:
df = pd.read_csv('purchases.csv')
df

  Unnamed: 0  apples  oranges
0       June       3        0
1     Robert       2        3
2       Lily       0        7
3      David       1        2

In [ ]:
#To avoid system genrated indexing

In [22]:
df = pd.read_csv('purchases.csv',index_col=0)
df

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [ ]:
#reading the data from JSON

json---Javascript object notion

In [30]:
df = pd.read_json('purchases.json')

df

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [ ]:
# I want to convert json to csv

In [32]:
df.to_csv('newpurchases.csv')

In [ ]:
#To check

In [34]:
df = pd.read_csv('newpurchases.csv')
df

  Unnamed: 0  apples  oranges
0       June       3        0
1     Robert       2        3
2       Lily       0        7
3      David       1        2

In [ ]:
I wantto convert csv to json

In [37]:
df.to_json('new_purchases.json')

In [39]:

df = pd.read_json('new_purchases.json')

df

  Unnamed: 0  apples  oranges
0       June       3        0
1     Robert       2        3
2       Lily       0        7
3      David       1        2